---
kind: type
id: T:Autodesk.Revit.DB.CategoryType
source: html/eb96f224-a134-50e6-57e8-32bcb13bee7d.htm
---
# Autodesk.Revit.DB.CategoryType

The type of category.

## Syntax (C#)
```csharp
public enum CategoryType
```